title: Cobalt Strike Named Pipe Detection
id: 77777777-bbbb-cccc-dddd-222222222223
status: test
description: Detects default Cobalt Strike named pipe patterns (MSSE-, postex, status_)
references:
  - https://attack.mitre.org/techniques/T1055/
  - https://www.cobaltstrike.com/blog/learn-pipe-fitting-for-all-of-your-offense-projects/
author: Rizko Febri Rachmayadi
date: 2024-01-15
tags:
  - attack.command-and-control
  - attack.t1055
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    PipeName|contains|any:
      - '\\msagent_'
      - '\\MSSE-'
      - '\\postex_'
      - '\\status_'
      - '\\beacon_'
      - '\\dns_'
  condition: selection
falsepositives:
  - Unknown
level: high

