title: BITSAdmin Download - Transfer Job
id: cccccccc-dddd-eeee-ffff-000000000000
status: test
description: Detects bitsadmin.exe being used to download files
references:
  - https://attack.mitre.org/techniques/T1197/
  - https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
author: Rizko Febri Rachmayadi
date: 2024-01-15
tags:
  - attack.defense-evasion
  - attack.t1197
  - attack.t1105
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \\bitsadmin.exe
  transfer:
    CommandLine|contains|all:
      - '/transfer'
      - 'http'
  addfile:
    CommandLine|contains|all:
      - '/addfile'
      - 'http'
  condition: selection and (transfer or addfile)
falsepositives:
  - Legitimate Windows Update or WSUS
level: medium

