title: CMSTP Execution - UAC Bypass and Proxy Execution
id: 6f7a8b9c-0d1e-2f3a-4b5c-6d7e8f9a0b1c
status: test
description: |
  Detects CMSTP (Connection Manager Profile Installer) execution used for
  UAC bypass and proxy execution of malicious code via INF files.
references:
  - https://attack.mitre.org/techniques/T1218/003/
  - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Cmstp.yml
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.003/T1218.003.md
author: Rizko Febri Rachmayadi
date: 2024-03-10
modified: 2024-06-15
tags:
  - attack.execution
  - attack.t1218.003
  - attack.defense-evasion
  - attack.t1548.002
logsource:
  category: process_creation
  product: windows
detection:
  selection_cmstp:
    Image|endswith: '\cmstp.exe'
    CommandLine|contains: '.inf'
  selection_cmstp_suspicious:
    Image|endswith: '\cmstp.exe'
    CommandLine|contains|all:
      - '/s'
      - '.inf'
  condition: 1 of selection_*
falsepositives:
  - Legitimate VPN/profile installation
level: high